uhnp/src/InformationRegisters/тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов/тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов</name>
  <comment>// Юдина (Гутарова) Екатерина 04.04.2024 Выполнение задач №000049104</comment>
  <resources>
    <name>УдалитьГУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>БазаРеспондентИД</name>
    <comment>// Чекордина Ирина 30.12.2025 Выполнение задач №000056058</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИДСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГУИД</name>
    <comment>// Белоконенко Денис 13.03.2025 Выполнение задач №000053020</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_Интеграция_СтатусыОбработкиСообщенийRMQ/тн_Интеграция_СтатусыОбработкиСообщенийRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_Интеграция_СтатусыОбработкиСообщенийRMQ</name>
  <comment>Выполнение задач №000040817</comment>
  <resources>
    <name>ВРаботе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПостановкиВРаботу</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИДСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_Интеграция_ОчередьОбработкиСообщенийRMQ/тн_Интеграция_ОчередьОбработкиСообщенийRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_Интеграция_ОчередьОбработкиСообщенийRMQ</name>
  <comment>Выполнение задач №000040817</comment>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ХешСумма</name>
    <comment>// Юдина (Гутарова) Екатерина 28.10.2024 Выполнение задач №000051341</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаРеспондентИД</name>
    <comment>// Чекордина Ирина 06.06.2025 Выполнение задач №000053932</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИДСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов/ManagerModule.bsl
// Юдина Екатерина 16.10.2025 Выполнение задач №000055524
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Юдина Екатерина 16.10.2025 Выполнение задач №000055524
#Область ПрограммныйИнтерфейс    

// Юдина Екатерина 16.10.2025 Выполнение задач №000055524
Процедура УдалитьСообщение(ИДСообщения, УдалитьСтатус = Ложь) Экспорт
	
	Если УдалитьСтатус Тогда
		РегистрыСведений.тн_Интеграция_СтатусыОбработкиСообщенийRMQ.УдалитьСтатус(ИДСообщения);
	КонецЕсли;
	
    Набор = РегистрыСведений.тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.СоздатьНаборЗаписей();
	Набор.Отбор.ИДСообщения.Установить(ИДСообщения);
	Набор.Записать();	
	
КонецПроцедуры // УдалитьСообщение()

// Чекордина Ирина 30.12.2025 Выполнение задач №000056058
Процедура ЗаполнитьБазуРеспондентИД(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.ИДСообщения КАК ИДСообщения,
		|	тн_Интеграция_ОчередьОбработкиСообщенийRMQ.БазаРеспондентИД КАК БазаРеспондентИД
		|ИЗ
		|	РегистрСведений.тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов КАК тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.тн_Интеграция_ОчередьОбработкиСообщенийRMQ КАК тн_Интеграция_ОчередьОбработкиСообщенийRMQ
		|		ПО тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.ИДСообщения = тн_Интеграция_ОчередьОбработкиСообщенийRMQ.ИДСообщения
		|			И (тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.БазаРеспондентИД = """")";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоОшибок = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НЗ = РегистрыСведений.тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.СоздатьНаборЗаписей();
		НЗ.Отбор.ИДСообщения.Установить(Выборка.ИДСообщения);
		НЗ.Прочитать();
		
		Если НЗ.Количество() > 0 Тогда
			
			Для Каждого Запись Из НЗ Цикл
				Запись.БазаРеспондентИД = Выборка.БазаРеспондентИД;
			КонецЦикла;
			
			Попытка
				НЗ.Записать(); 
			Исключение
				КоличествоОшибок = КоличествоОшибок + 1;
			КонецПопытки;
				
		КонецЕсли;
			
	КонецЦикла;
	
	Если КоличествоОшибок > 0 Тогда
		ЗаписьЖурналаРегистрации("Обновление информационной базы", УровеньЖурналаРегистрации.Ошибка, 
		Метаданные.РегистрыСведений.тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов, ,
		"Не удалось записать " + КоличествоОшибок + " наборов записей при выполнении обработчика обновления РегистрыСведений.тн_Интеграция_ОчередьОжиданияЗагрузкиЗависимыхОбъектов.ЗаполнитьБазуРеспондентИД"); 
	КонецЕсли;
	
КонецПроцедуры

// Юдина Екатерина 16.10.2025 Выполнение задач №000055524
#КонецОбласти

// Юдина Екатерина 16.10.2025 Выполнение задач №000055524
#КонецЕсли
